# Chapter 6

Function	Description
read_csv	Load delimited data from a file, URL, or file-like object; use comma as default delimiter
read_fwf	Read data in fixed-width column format (i.e., no delimiters)
read_clipboard	Variation of read_csv that reads data from the clipboard; useful for converting tables from web pages
read_excel	Read tabular data from an Excel XLS or XLSX file
read_hdf	Read HDF5 files written by pandas
read_html	Read all tables found in the given HTML document
read_json	Read data from a JSON (JavaScript Object Notation) string representation, file, URL, or file-like object
read_feather	Read the Feather binary file format
read_orc	Read the Apache ORC binary file format
read_parquet	Read the Apache Parquet binary file format
read_pickle	Read an object stored by pandas using the Python pickle format
read_sas	Read a SAS dataset stored in one of the SAS system's custom storage formats
read_spss	Read a data file created by SPSS
read_sql	Read the results of a SQL query (using SQLAlchemy)
read_sql_table	Read a whole SQL table (using SQLAlchemy); equivalent to using a query that selects everything in that table using read_sql
read_stata	Read a dataset from Stata file format
read_xml	Read a table of data from an XML file

In [205]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [206]:
import pandas as pd

In [207]:
df = pd.read_csv("examples/ex1.csv")

In [208]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [209]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [210]:
pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [211]:
pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [212]:
names = ["a", "b", "c", "d", "message"]

In [213]:
pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [214]:
!cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [215]:
parsed = pd.read_csv("examples/csv_mindex.csv",
                     index_col=["key1", "key2"])

In [216]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [217]:
!cat examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [218]:
result = pd.read_csv("examples/ex3.txt", sep="\\s+")

In [220]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [118]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [119]:
pd.read_csv("examples/ex4.csv", skiprows=[0,  2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [120]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [121]:
result = pd.read_csv("examples/ex5.csv")

In [122]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [123]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [124]:
result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [125]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [126]:
result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [127]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [128]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [129]:
result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False,
                      na_values=["NA"])

In [130]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [131]:
pd.read_csv("examples/ex5.csv", na_values=sentinels,
            keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

Argument	Description
path	String indicating filesystem location, URL, or file-like object.
sep or delimiter	Character sequence or regular expression to use to split fields in each row.
header	Row number to use as column names; defaults to 0 (first row), but should be None if there is no header row.
index_col	Column numbers or names to use as the row index in the result; can be a single name/number or a list of them for a hierarchical index.
names	List of column names for result.
skiprows	Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.
na_values	Sequence of values to replace with NA. They are added to the default list unless keep_default_na=False is passed.
keep_default_na	Whether to use the default NA value list or not (True by default).
comment	Character(s) to split comments off the end of lines.
parse_dates	Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns. Otherwise, can specify a list of column numbers or names to parse. If element of list is tuple or list, will combine multiple columns together and parse to date (e.g., if date/time split across two columns).
keep_date_col	If joining columns to parse date, keep the joined columns; False by default.
converters	Dictionary containing column number or name mapping to functions (e.g., {"foo": f} would apply the function f to all values in the "foo" column).
dayfirst	When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7, 2012); False by default.
date_parser	Function to use to parse dates.
nrows	Number of rows to read from beginning of file (not counting the header).
iterator	Return a TextFileReader object for reading the file piecemeal. This object can also be used with the with statement.
chunksize	For iteration, size of file chunks.
skip_footer	Number of lines to ignore at end of file.
verbose	Print various parsing information, like the time spent in each stage of the file conversion and memory use information.
encoding	Text encoding (e.g., "utf-8 for UTF-8 encoded text). Defaults to "utf-8" if None.
squeeze	If the parsed data contains only one column, return a Series.
thousands	Separator for thousands (e.g., "," or "."); default is None.
decimal	Decimal separator in numbers (e.g., "." or ","); default is ".".
engine	CSV parsing and conversion engine to use; can be one of "c", "python", or "pyarrow". The default is "c", though the newer "pyarrow" engine can parse some files much faster. The "python" engine is slower but supports some features that the other engines do not.

In [132]:
pd.options.display.max_rows = 20

In [133]:
result = pd.read_csv("examples/ex6.csv")

In [134]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [135]:
pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

To read a file in pieces, specify a chunksize as a number of rows:

In [136]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [137]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [138]:
chunker = pd.read_csv("examples/ex6.csv", chunksize = 1000)

In [139]:
tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

In [140]:
tot[:10]

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
dtype: float64

In [141]:
tot = tot.sort_values(ascending=False)

In [142]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [143]:
data = pd.read_csv("examples/ex5.csv")

In [144]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [145]:
data.to_csv("examples/out.csv")

In [146]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [147]:
import sys

In [148]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [149]:
data.to_csv(sys.stdout, na_rep="NULL")   # Missing values appear as empty strings in the output. You might want to denote them by some other sentinel value:

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [150]:
data.to_csv(sys.stdout, index=False, header=False)  #header and index are disabled

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [151]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [152]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [153]:
import csv

In [154]:
f = open("examples/ex7.csv")

In [155]:
reader = csv.reader(f)

In [156]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [157]:
f.close()

In [158]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f))

In [159]:
header, values = lines[0], lines[1:]

In [160]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [161]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [162]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [163]:
with open("examples/ex7.csv") as f:
    reader = csv.reader(f, dialect=my_dialect)

In [164]:
with open("examples/ex7.csv") as f:
    lines = list(csv.reader(f, dialect=my_dialect))

In [165]:
with open("examples/ex7.csv") as f:
    reader = csv.reader(f, delimiter="|")

Argument	Description
delimiter	One-character string to separate fields; defaults to ",".
lineterminator	Line terminator for writing; defaults to "\r\n". Reader ignores this and recognizes cross-platform line terminators.
quotechar	Quote character for fields with special characters (like a delimiter); default is '"'.
quoting	Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINIMAL (only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and csv.QUOTE_NONE (no quoting). See Pythonâ€™s documentation for full details. Defaults to QUOTE_MINIMAL.
skipinitialspace	Ignore whitespace after each delimiter; default is False.
doublequote	How to handle quoting character inside a field; if True, it is doubled (see online documentation for full detail and behavior).
escapechar	String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default.

In [166]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

JSON Data

In [167]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [168]:
import json

In [169]:
result = json.loads(obj)

In [170]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [171]:
{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott',
   'age': 34,
   'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [172]:
asjson = json.dumps(result)

In [173]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [174]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [175]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [176]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [177]:
data = pd.read_json("examples/example.json")

In [178]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [179]:
In [78]: data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [180]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [181]:
conda install lxml beautifulsoup4 html5lib

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [182]:
tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [183]:
len(tables)

1

In [184]:
failures = tables[0]

In [185]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [186]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [187]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, dtype: int64

In [188]:
from lxml import objectify

In [189]:
path = "/Users/deepa/Documents/Projects/WesCh5/pydata-book/datasets/mta_perf/Performance_MNR.xml"

# Open the file
with open(path) as f:
    parsed = objectify.parse(f)

In [190]:
root = parsed.getroot()

In [191]:
data = []

skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [192]:
perf = pd.DataFrame(data)

In [193]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [194]:
perf2 = pd.read_xml(path)

In [195]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [196]:
frame = pd.read_csv("examples/ex1.csv")

In [197]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [198]:
frame.to_pickle("examples/frame_pickle")

In [199]:
pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [200]:
conda install pyarrow

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [201]:
In [100]: fec = pd.read_parquet('/Users/deepa/Documents/Projects/WesCh5/pydata-book/datasets/fec/fec.parquet')

Reading Microsoft Excel Files

In [202]:
conda install openpyxl xlrd

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [203]:
!pip install --upgrade openpyxl

Requirement already satisfied: openpyxl in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /Users/deepa/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [221]:
xlsx = pd.ExcelFile("/Users/deepa/Documents/Projects/WesCh678/examples/ex1.xlsx")

In [223]:
xlsx.sheet_names

['Sheet1']

In [224]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [227]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [228]:
frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [229]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

To write pandas data to Excel format, you must first create an ExcelWriter, then write data to it using the pandas object's to_excel method:

In [243]:
writer = pd.ExcelWriter("examples/ex2.xlsx")

In [244]:
frame.to_excel(writer, sheet_name = "Sheet1")

In [245]:
writer.close()

In [246]:
frame.to_excel("examples/ex2.xlsx")

In [247]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [248]:
conda install pytables

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/deepa/Library/jupyterlab-desktop/jlab_server

  added / updated specs:
    - pytables


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    blosc-1.21.3               |       h313beb8_0          41 KB
    c-blosc2-2.12.0            |       h7df6c2f_0         266 KB
    hdf5-1.12.1                |       h05c076b_3         5.3 MB
    numexpr-2.8.7              |  py312h0f3ea24_0         134 KB
    py-cpuinfo-9.0.0           |  py312hca03da5_0          60 KB
    pytables-3.9.2             |  py312h905a39b_0         1.5 MB
    zlib-1.2.13                |       h53f4e23_5          78 KB  conda-forge
    zlib-ng-2.0.7              |       h80987f9_0          92 KB
    ------------------------------------------------------------
                                           Total:         7.4 MB

The following NEW packages will be INSTALLED:

  blosc              pkgs/main/osx-arm64::blosc-1.21.3-h313beb8_0
  c-blosc2           pkgs/main/osx-arm64::c-blosc2-2.12.0-h7df6c2f_0
  hdf5               pkgs/main/osx-arm64::hdf5-1.12.1-h05c076b_3
  numexpr            pkgs/main/osx-arm64::numexpr-2.8.7-py312h0f3ea24_0
  py-cpuinfo         pkgs/main/osx-arm64::py-cpuinfo-9.0.0-py312hca03da5_0
  pytables           pkgs/main/osx-arm64::pytables-3.9.2-py312h905a39b_0
  zlib               conda-forge/osx-arm64::zlib-1.2.13-h53f4e23_5
  zlib-ng            pkgs/main/osx-arm64::zlib-ng-2.0.7-h80987f9_0



Downloading and Extracting Packages:
hdf5-1.12.1          | 5.3 MB    |                                       |   0%
pytables-3.9.2       | 1.5 MB    |                                       |   0%

c-blosc2-2.12.0      | 266 KB    |                                       |   0%


numexpr-2.8.7        | 134 KB    |                                       |   0%



zlib-ng-2.0.7        | 92 KB     |                                       |   0%




zlib-1.2.13          | 78 KB     |                                       |   0%





py-cpuinfo-9.0.0     | 60 KB     |                                       |   0%






blosc-1.21.3         | 41 KB     |                                       |   0%


numexpr-2.8.7        | 134 KB    | ####4                                 |  12%
hdf5-1.12.1          | 5.3 MB    | 1                                     |   0%

c-blosc2-2.12.0      | 266 KB    | ##2                                   |   6%



zlib-ng-2.0.7        | 92 KB     | ######4                               |  17%


numexpr-2.8.7        | 134 KB    | ##################################### | 100%
pytables-3.9.2       | 1.5 MB    | #####6                                |  15%



hdf5-1.12.1          | 5.3 MB    | #3                                    |   4%

c-blosc2-2.12.0      | 266 KB    | ##################################### | 100%

c-blosc2-2.12.0      | 266 KB    | ##################################### | 100%





py-cpuinfo-9.0.0     | 60 KB     | #########9                            |  27%





py-cpuinfo-9.0.0     | 60 KB     | ##################################### | 100%






blosc-1.21.3         | 41 KB     | ##############5                       |  39%
pytables-3.9.2       | 1.5 MB    | #############5                        |  37%






hdf5-1.12.1          | 5.3 MB    | ##7                                   |   7%
hdf5-1.12.1          | 5.3 MB    | ######2                               |  17%




zlib-1.2.13          | 78 KB     | #######6                              |  21%




hdf5-1.12.1          | 5.3 MB    | ########8                             |  24%





























Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [275]:
import numpy as np

In [276]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [277]:
store = pd.HDFStore("examples/mydata.h5")

In [278]:
store["obj1"] = frame

In [279]:
store["obj1_col"] = frame["a"]

In [280]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [281]:
store["obj1"]

           a
0  -0.140252
1   0.064584
2  -0.520969
3   1.364837
4   0.047285
..       ...
95 -0.292040
96 -0.034235
97  0.302287
98  0.544724
99  0.728344

[100 rows x 1 columns]

In [282]:
store.put("obj2", frame, format="table")   #HDFStore supports two storage schemas, "fixed" and "table" (the default is "fixed"). The latter is generally slower, but it supports query operations using a special syntax:

In [283]:
result = store.select("obj2", where=["index >= 10 and index <= 15"])

In [284]:
store.close()  # Close the store after performing operations

In [309]:
store = pd.HDFStore("examples/mydata.h5" )

In [310]:
store.put("obj2", frame, format="table")

In [312]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10  1.065771
11 -0.881218
12 -0.005201
13 -1.009282
14  0.390268
15 -1.043439

In [313]:
frame.to_hdf("examples/mydata.h5", "obj3", format="table")

/var/folders/cn/2lgryvj10c92k5wktj1wn8tr0000gp/T/ipykernel_61624/1277131479.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf("examples/mydata.h5", "obj3", format="table")

In [314]:
pd.read_hdf("examples/mydata.h5", "obj3", where=["index < 5"])

ValueError: The file 'examples/mydata.h5' is already opened, but not in read-only mode (as requested).

In [315]:
import os

In [316]:
os.remove("examples/mydata.h5")

In [317]:
conda install requests

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/deepa/Library/jupyterlab-desktop/jlab_server

  added / updated specs:
    - requests


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    requests-2.31.0            |  py312hca03da5_1         121 KB
    ------------------------------------------------------------
                                           Total:         121 KB

The following packages will be UPDATED:

  requests           conda-forge/noarch::requests-2.31.0-p~ --> pkgs/main/osx-arm64::requests-2.31.0-py312hca03da5_1



Downloading and Extracting Packages:

Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [318]:
import requests

In [319]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [320]:
resp = requests.get(url)

In [321]:
resp.raise_for_status()

In [322]:
resp

In [323]:
data = resp.json()

In [324]:
data[0]["title"]

'DEPR: enforce Sparse deprecations'

In [326]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [327]:
issues

,number,title,labels,state
0,58167,DEPR: enforce Sparse deprecations,[],open
1,58166,TST: Use temp_file fixture over ensure_clean,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
2,58165,PERF: more realistic np datetime c benchmark,[],open
3,58164,BUILD: C code coverage,[],open
4,58163,DOC: Add notes to nullable types documentation...,[],open
...,...,...,...,...
25,58131,BUG: read_csv file handle not closed after error,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,58130,BUG: Integers with extreme values are incorrec...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,58129,Convert result of group by agg to pyarrow if i...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
28,58128,"When excel cell with 0x005F_FFFF, pandas read ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,58125,CLN: enforce deprecation of the `kind` keyword...,[],open

In [328]:
import sqlite3

In [329]:
query = """
   .....: CREATE TABLE test
   .....: (a VARCHAR(20), b VARCHAR(20),
   .....:  c REAL,        d INTEGER
   .....: );"""

In [330]:
con = sqlite3.connect("mydata.sqlite")

In [331]:
con.execute(query)

In [332]:
con.commit()

In [333]:
data = [("Atlanta", "Georgia", 1.25, 6),
   .....:         ("Tallahassee", "Florida", 2.6, 3),
   .....:         ("Sacramento", "California", 1.7, 5)]

In [334]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [335]:
con.executemany(stmt, data)

In [336]:
con.commit()

In [337]:
cursor = con.execute("SELECT * FROM test")

In [338]:
rows = cursor.fetchall()

In [339]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [340]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [341]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [342]:
conda install sqlalchemy

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/deepa/Library/jupyterlab-desktop/jlab_server

  added / updated specs:
    - sqlalchemy


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    greenlet-3.0.1             |  py312h313beb8_0         221 KB
    sqlalchemy-2.0.25          |  py312h80987f9_0         3.8 MB
    ------------------------------------------------------------
                                           Total:         4.0 MB

The following NEW packages will be INSTALLED:

  greenlet           pkgs/main/osx-arm64::greenlet-3.0.1-py312h313beb8_0
  sqlalchemy         pkgs/main/osx-arm64::sqlalchemy-2.0.25-py312h80987f9_0



Downloading and Extracting Packages:
sqlalchemy-2.0.25    | 3.8 MB    |                                       |   0%
sqlalchemy-2.0.25    | 3.8 MB    | 1                                     |   0%
sqlalchemy-2.0.25    | 3.8 MB    | ###2                                  |   9%
greenlet-3.0.1       | 221 KB    | ##################################### | 100%


Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [343]:
import sqlalchemy as sqla

In [344]:
db = sqla.create_engine("sqlite:///mydata.sqlite")

In [345]:
pd.read_sql("SELECT * FROM test", db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5